public class ScreenMonitoring {
    //каждую секунду после включения программы
    //проверяется с помощью класса TemplateMatch
    //наличие на экране оригинального текста (из AreaScreenshot
    //геттером можно достать массив (или map) картинок-скриншотов),
    //сеттером наполняется заново каждые n секунд массив картинок в ScreenMonitoring

    //если панелька с переводом была удалена
    //сравнить value у map скриншотов и name панельки
    //если строки одинаковы -> удалить из map
}
